# StairsShowUpText Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsShowUpText Property
ParameterTypeId Class See Also
---
"Show Up Text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsShowUpText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsShowUpText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsShowUpText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace